Revit 2016 API
ObjectFactory Class
 For Internal Use Only.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
public class ObjectFactory : IDisposable
Visual Basic
Public Class ObjectFactory _
	Implements IDisposable
Visual C++
public ref class ObjectFactory : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ObjectFactory
See Also
ObjectFactory Members
Autodesk.Revit.DB Namespace